import math


def area(r):
    '''
    Возвращает площадь круга радиуса r.

        Параметры:
            r (float) - радиус (вещественное число)
        
        Возвращаемое значение: math.pi * r * r (float) - площадь круга данного радиуса
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    Возвращает длину окружности радиуса r.

        Параметры:
            r (float) - радиус (вещественное число)
        
        Возвращаемое значение: 2 * math.pi * r (float) - длина окружности данного радиуса
    '''
    return 2 * math.pi * r